SiliconLabs/Gecko_SDK_discontinued/platform/Device/SiliconLabs/EFR32MG2P/Include/efr32mg2p233f1024gl125.h
/* Bit fields for WTIMER DTLOCK */
#define _WTIMER_DTLOCK_RESETVALUE                   0x00000000UL                           /**< Default value for WTIMER_DTLOCK */
#define _WTIMER_DTLOCK_MASK                         0x0000FFFFUL                           /**< Mask for WTIMER_DTLOCK */
#define _WTIMER_DTLOCK_LOCKKEY_SHIFT                0                                      /**< Shift value for TIMER_LOCKKEY */
#define _WTIMER_DTLOCK_LOCKKEY_MASK                 0xFFFFUL                               /**< Bit mask for TIMER_LOCKKEY */
#define _WTIMER_DTLOCK_LOCKKEY_DEFAULT              0x00000000UL                           /**< Mode DEFAULT for WTIMER_DTLOCK */
#define _WTIMER_DTLOCK_LOCKKEY_LOCK                 0x00000000UL                           /**< Mode LOCK for WTIMER_DTLOCK */
#define _WTIMER_DTLOCK_LOCKKEY_UNLOCKED             0x00000000UL                           /**< Mode UNLOCKED for WTIMER_DTLOCK */
#define _WTIMER_DTLOCK_LOCKKEY_LOCKED               0x00000001UL                           /**< Mode LOCKED for WTIMER_DTLOCK */
#define _WTIMER_DTLOCK_LOCKKEY_UNLOCK               0x0000CE80UL                           /**< Mode UNLOCK for WTIMER_DTLOCK */
#define WTIMER_DTLOCK_LOCKKEY_DEFAULT               (_WTIMER_DTLOCK_LOCKKEY_DEFAULT << 0)  /**< Shifted mode DEFAULT for WTIMER_DTLOCK */
#define WTIMER_DTLOCK_LOCKKEY_LOCK                  (_WTIMER_DTLOCK_LOCKKEY_LOCK << 0)     /**< Shifted mode LOCK for WTIMER_DTLOCK */
#define WTIMER_DTLOCK_LOCKKEY_UNLOCKED              (_WTIMER_DTLOCK_LOCKKEY_UNLOCKED << 0) /**< Shifted mode UNLOCKED for WTIMER_DTLOCK */
#define WTIMER_DTLOCK_LOCKKEY_LOCKED                (_WTIMER_DTLOCK_LOCKKEY_LOCKED << 0)   /**< Shifted mode LOCKED for WTIMER_DTLOCK */
#define WTIMER_DTLOCK_LOCKKEY_UNLOCK                (_WTIMER_DTLOCK_LOCKKEY_UNLOCK << 0)   /**< Shifted mode UNLOCK for WTIMER_DTLOCK */

/** @} End of group EFR32MG2P233F1024GL125_WTIMER */



/**************************************************************************//**
 * @defgroup EFR32MG2P233F1024GL125_SYSTICK_BitFields  EFR32MG2P233F1024GL125_SYSTICK Bit Fields
 * @{
 *****************************************************************************/

/** @} End of group EFR32MG2P233F1024GL125_SYSTICK */



/**************************************************************************//**
 * @defgroup EFR32MG2P233F1024GL125_UNLOCK EFR32MG2P233F1024GL125 Unlock Codes
 * @{
 *****************************************************************************/
#define MSC_UNLOCK_CODE         0x1B71 /**< MSC unlock code */
#define EMU_UNLOCK_CODE         0xADE8 /**< EMU unlock code */
#define RMU_UNLOCK_CODE         0xE084 /**< RMU unlock code */
#define CMU_UNLOCK_CODE         0x580E /**< CMU unlock code */
#define GPIO_UNLOCK_CODE        0xA534 /**< GPIO unlock code */
#define TIMER_UNLOCK_CODE       0xCE80 /**< TIMER unlock code */
#define PROTIMER_UNLOCK_CODE    0xCE80 /**< PROTIMER unlock code */
#define RTCC_UNLOCK_CODE        0xAEE8 /**< RTCC unlock code */

/** @} End of group EFR32MG2P233F1024GL125_UNLOCK */

/** @} End of group EFR32MG2P233F1024GL125_BitFields */

/**************************************************************************//**
 * @defgroup EFR32MG2P233F1024GL125_Alternate_Function EFR32MG2P233F1024GL125 Alternate Function
 * @{
 *****************************************************************************/

#include "efr32mg2p_af_ports.h"
#include "efr32mg2p_af_pins.h"

/** @} End of group EFR32MG2P233F1024GL125_Alternate_Function */

/**************************************************************************//**
 *  @brief Set the value of a bit field within a register.
 *
 *  @param REG
 *       The register to update
 *  @param MASK
 *       The mask for the bit field to update
 *  @param VALUE
 *       The value to write to the bit field
 *  @param OFFSET
 *       The number of bits that the field is offset within the register.
 *       0 (zero) means LSB.
 *****************************************************************************/
#define SET_BIT_FIELD(REG, MASK, VALUE, OFFSET) \
  REG = ((REG) &~(MASK)) | (((VALUE) << (OFFSET)) & (MASK));

/** @} End of group EFR32MG2P233F1024GL125 */

/** @} End of group Parts */

#ifdef __cplusplus
}
#endif
#endif /* EFR32MG2P233F1024GL125_H */
